In [39]:
import pandas as pd
import numpy as np

In [40]:
df_exams = pd.read_csv('./StudentsPerformance.csv')
df_exams.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

# 1 Selecting one column

## 1.1 Syntax 1

In [41]:
# select  a column with [] (preferred)

df_exams['gender']

0      female
1      female
2      female
3        male
4        male
        ...
995    female
996      male
997    female
998    female
999    female
Name: gender, Length: 1000, dtype: object

In [42]:
# check out the data types f a column

type(df_exams['gender'])

pandas.core.series.Series

In [43]:
# series: attributes and methods

df_exams['gender'].index
df_exams['gender'].head(10)

0    female
1    female
2    female
3      male
4      male
5    female
6    female
7      male
8      male
9    female
Name: gender, dtype: object

# 1.2 Syntax 2

In [44]:
# select a column with "."

df_exams.gender.head()

0    female
1    female
2    female
3      male
4      male
Name: gender, dtype: object

In [45]:
# select a column with "." (pitfalls)

#df_exams.math score  # "." cannot be used if the column name has space.

In [46]:
# select the samw column using []

df_exams['math score'].head()

0    72
1    69
2    90
3    47
4    76
Name: math score, dtype: int64

# 2 Selecting two or more columns

In [47]:
# select 2 columns using [[]]

df_exams[['gender', 'math score']].head()

   gender  math score
0  female          72
1  female          69
2  female          90
3    male          47
4    male          76

In [48]:
# checkout the data type of the selection

type(df_exams[['gender', 'math score']].head())

pandas.core.frame.DataFrame

In [49]:
# select 2 or more columns using [[]]
df_exams[['gender', 'writing score', 'math score', 'reading score']].head()

   gender  writing score  math score  reading score
0  female             74          72             72
1  female             88          69             90
2  female             93          90             95
3    male             44          47             57
4    male             75          76             78

In [50]:
# we can't select 2 or more columns with the "."

#df_exams.'gender','math score'